package com.param.test;

import com.alibaba.fastjson2.JSON;
import com.alibaba.fastjson2.TypeReference;

import java.util.Map;

/**
 * @ClassName:JSONTest
 * @author: qm
 * @Description:
 * @date:2025-03-26
 */
public class JSONTest {
    public static void main(String[] args) {
        String json ="{\n" +
                "    \"12306网餐\": \"B007\",\n" +
                "    \"20代金券\": \"B007\",\n" +
                "    \"26元餐标\": \"B007\",\n" +
                "    \"50代金券\": \"B007\",\n" +
                "    \"5i会员\": \"B003\",\n" +
                "    \"925机场补贴\": \"B007\",\n" +
                "    \"万达小程序\": \"B007\",\n" +
                "    \"万达钱包\": \"B007\",\n" +
                "    \"业主预付款\": \"B007\",\n" +
                "    \"业主餐卡\": \"B007\",\n" +
                "    \"东方福利网\": \"B007\",\n" +
                "    \"买单云\": \"B007\",\n" +
                "    \"云闪付\": \"B016\",\n" +
                "    \"云闪付(商场代收)\": \"B011\",\n" +
                "    \"交通银行APP支付\": \"B012\",\n" +
                "    \"企业团餐支付\": \"B007\",\n" +
                "    \"优托邦支付\": \"B007\",\n" +
                "    \"关爱通支付\": \"B007\",\n" +
                "    \"其它渠道\": \"B016\",\n" +
                "    \"凤凰知音\": \"B007\",\n" +
                "    \"同城(商场代收)\": \"B011\",\n" +
                "    \"吾悦付\": \"B007\",\n" +
                "    \"员工餐\": \"B087\",\n" +
                "    \"和卡\": \"B007\",\n" +
                "    \"商品券\": \"B007\",\n" +
                "    \"商场代收\": \"B011\",\n" +
                "    \"商场会员卡\": \"B007\",\n" +
                "    \"商场会员卡(专用)\": \"B011\",\n" +
                "    \"商场员工餐\": \"B007\",\n" +
                "    \"园区点券\": \"B007\",\n" +
                "    \"国航7折活动\": \"B007\",\n" +
                "    \"对个人账户(商场代收)\": \"B011\",\n" +
                "    \"对公账户(商场代收)\": \"B011\",\n" +
                "    \"平安银行\": \"B007\",\n" +
                "    \"广发银行\": \"B012\",\n" +
                "    \"建行app支付\": \"B007\",\n" +
                "    \"微信\": \"B005\",\n" +
                "    \"微信(商场代收)\": \"B011\",\n" +
                "    \"微信工行扫码\": \"B011\",\n" +
                "    \"微信扫码(商场代收)\": \"B011\",\n" +
                "    \"快手本地生活\": \"B007\",\n" +
                "    \"悠饭企业餐\": \"B007\",\n" +
                "    \"悠饭团餐\": \"B007\",\n" +
                "    \"悠饭平台\": \"B007\",\n" +
                "    \"招商银行\": \"B012\",\n" +
                "    \"招商银行APP支付\": \"B012\",\n" +
                "    \"招行APP支付\": \"B007\",\n" +
                "    \"携程(商场代收)\": \"B011\",\n" +
                "    \"支付宝\": \"B004\",\n" +
                "    \"支付宝(商场代收)\": \"B011\",\n" +
                "    \"数字人民币(商场代收)\": \"B011\",\n" +
                "    \"易吃点\": \"B007\",\n" +
                "    \"机场内部员工消费\": \"B007\",\n" +
                "    \"民生银行\": \"B012\",\n" +
                "    \"泰盛卡\": \"B007\",\n" +
                "    \"浦发银行\": \"B007\",\n" +
                "    \"熙香\": \"B007\",\n" +
                "    \"物业小程序\": \"B007\",\n" +
                "    \"物业收款\": \"B011\",\n" +
                "    \"环球通卡\": \"B007\",\n" +
                "    \"现金\": \"B001\",\n" +
                "    \"现金(商场代收)\": \"B011\",\n" +
                "    \"现金券\": \"B007\",\n" +
                "    \"瑞祥卡\": \"B007\",\n" +
                "    \"索贝瑞专用\": \"B007\",\n" +
                "    \"索迪斯专用\": \"B007\",\n" +
                "    \"索迪斯线下\": \"B007\",\n" +
                "    \"线下扫码支付\": \"B007\",\n" +
                "    \"美食登机牌\": \"B011\",\n" +
                "    \"美餐网支付\": \"B007\",\n" +
                "    \"补单\": \"B089\",\n" +
                "    \"车间打包签单\": \"B006\",\n" +
                "    \"金华永盛储值卡\": \"B007\",\n" +
                "    \"银联(商场代收)\": \"B011\",\n" +
                "    \"银联商务POS\": \"B002\",\n" +
                "    \"银联刷卡机\": \"B002\",\n" +
                "    \"顺丰丰食\": \"B007\",\n" +
                "    \"餐卡扫码付\": \"B011\",\n" +
                "    \"饭卡(商场代收)\": \"B011\",\n" +
                "    \"饭折卡\": \"B007\",\n" +
                "    \"30元招商代金券（15代30）\": \"B012\",\n" +
                "    \"30元招商代金券（27代30）\": \"B012\",\n" +
                "    \"30元招商银行代金券\": \"B012\",\n" +
                "    \"50元招商银行代金券\": \"B012\",\n" +
                "    \"中信银行代金券50元\": \"B012\",\n" +
                "    \"乾隆冰芯蛋(美团229店)\": \"B009\",\n" +
                "    \"广发10元代金券\": \"B012\",\n" +
                "    \"广发32元代金券\": \"B012\",\n" +
                "    \"招行代金券100元\": \"B012\",\n" +
                "    \"招行代金券20元\": \"B012\",\n" +
                "    \"招行代金券30元\": \"B012\",\n" +
                "    \"招行代金券50元\": \"B012\",\n" +
                "    \"民生25元优惠券\": \"B012\",\n" +
                "    \"民生50元优惠券\": \"B012\",\n" +
                "    \"民生7元优惠券\": \"B012\",\n" +
                "    \"草本汤笋衣面\": \"B008\"\n" +
                "}\n";

        Map<String,String> map = JSON.parseObject(json, new TypeReference<Map<String, String>>() {});

        map.forEach((k,v)->{
            System.out.println(1+"\t"+k+"\t"+v);
        });
    }
}
